In [18]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder,StandardScaler
from sklearn import linear_model

In [19]:
df=pd.read_csv(r"C:\Users\Manali\Desktop\datasets\hiringinterview.csv" , decimal=',')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [20]:
import math
median_test_score=math.floor(df.test_score.median())
median_test_score

8

In [21]:
df.test_score=df.test_score.fillna(median_test_score)
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [22]:
df.experience=df.experience.fillna('zero')
df

  experience  test_score  interview_score  salary
0       zero         8.0                9   50000
1       zero         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         8.0                7   72000
7     eleven         7.0                8   80000

In [23]:
cols_with_obj_type = [c for c,d in zip(df.columns,df.dtypes) if d == np.object]

In [24]:
label_encoder = LabelEncoder()
Scaler = StandardScaler()

In [25]:
for col in cols_with_obj_type:
    df[col] = label_encoder.fit_transform(df[col])

In [26]:
db = Scaler.fit_transform(df)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\preprocessing\data.py:645: DataConversionWarning: Data with input dtype int32, int64, float64 were all converted to float64 by StandardScaler.
  return self.partial_fit(X, y)
C:\ProgramData\Anaconda3\lib\site-packages\sklearn\base.py:464: DataConversionWarning: Data with input dtype int32, int64, float64 were all converted to float64 by StandardScaler.
  return self.fit(X, **fit_params).transform(X)

In [28]:
db = pd.DataFrame(db, columns=df.columns)

In [40]:
db

   experience  test_score  interview_score    salary
0    1.239591    0.107211         0.732410 -1.208322
1    1.239591    0.107211        -1.220683 -1.673062
2   -1.121535   -1.608169        -0.569652 -0.278844
3    0.767366    1.822591         1.383440  0.185896
4   -0.649309    0.964901        -1.220683  0.650635
5    0.295141   -0.750479         1.383440 -0.092948
6   -0.177084    0.107211        -0.569652  0.836531
7   -1.593760   -0.750479         0.081379  1.580114

In [33]:
# creating linear model object

reg=linear_model.LinearRegression()
reg.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [34]:
reg.coef_

array([-5551.14001858,  4535.46327401,  1983.346437  ])

In [35]:
reg.intercept_

30399.4710885569

In [38]:
reg.predict([[1.239591,0.107211,0.732410]])

array([25457.20219877])

In [39]:
-5551.14001858*1.239591+4535.46327401*0.107211+1983.346437*0.732410+30399.4710885569

25457.202198778356